atanisoft/ESP32CommandStation/main/WebServer.cpp
/**********************************************************************
ESP32 COMMAND STATION

COPYRIGHT (c) 2017-2021 Mike Dunston

  This program is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.
  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.
  You should have received a copy of the GNU General Public License
  along with this program.  If not, see http://www.gnu.org/licenses
**********************************************************************/

#include "sdkconfig.h"

#include <CDIClient.hxx>
#include <CDIDownloader.hxx>
#include <cJSON.h>
#include <dcc/Loco.hxx>
#include <dcc/DccOutput.hxx>
#include <Dnsd.h>
#include <DCCSignalVFS.hxx>
#include <DelayRebootHelper.hxx>
#include <esp_log.h>
#include <esp_ota_ops.h>
#include <EventBroadcastHelper.hxx>
#include <executor/Service.hxx>
#include <Httpd.h>
#include <mutex>
#include <NvsManager.hxx>
#include <OTAWatcher.hxx>
#include <StatusLED.hxx>
#include <TrainDatabase.hxx>
#include <locomgr/LocoManager.hxx>
#include <AccessoryDecoderDatabase.hxx>
#include <UlpAdc.hxx>
#include <utils/FileUtils.hxx>
#include <utils/SocketClientParams.hxx>
#include <utils/StringPrintf.hxx>
#include <utils/StringUtils.hxx>

using locodb::DriveMode;
using locodb::Function;
using locomgr::LocoManager;
using dcc::SpeedType;
using esp32cs::AccessoryDecoderDB;
using esp32cs::AccessoryType;
using esp32cs::Esp32TrainDatabase;
using esp32cs::EventBroadcastHelper;
using esp32cs::NvsManager;
using esp32cs::OTAWatcherFlow;
using esp32cs::StatusLED;
using http::AbstractHttpResponse;
using http::HTTP_ENCODING_GZIP;
using http::HTTP_ENCODING_NONE;
using http::Httpd;
using http::HttpMethod;
using http::HttpRequest;
using http::HttpStatusCode;
using http::JsonResponse;
using http::MIME_TYPE_IMAGE_GIF;
using http::MIME_TYPE_IMAGE_PNG;
using http::MIME_TYPE_TEXT_CSS;
using http::MIME_TYPE_TEXT_HTML;
using http::MIME_TYPE_TEXT_JAVASCRIPT;
using http::MIME_TYPE_TEXT_PLAIN;
using http::MIME_TYPE_TEXT_XML;
using http::StringResponse;
using http::WebSocketEvent;
using http::WebSocketFlow;
using openlcb::DatagramClient;
using openlcb::Defs;
using openlcb::MemoryConfigClient;
using openlcb::MemoryConfigClientRequest;
using openlcb::MemoryConfigDefs;
using openlcb::NodeHandle;

// Captive Portal landing page
static constexpr const char *const CAPTIVE_PORTAL_HTML = R"!^!(
<html>
 <head>
  <title>ESP32 Command Station v%s</title>
  <meta http-equiv="refresh" content="30;url='/captiveauth'" />
 </head>
 <body>
  <h1>Welcome to the ESP32 Command Station</h1>
  <h2>Open your browser and navigate to any website and it will open the ESP32 Command Station</h2>
  <p>Click <a href="/captiveauth">here</a> to close this portal page if it does not automatically close.</p>
 </body>
</html>)!^!";

WEBSOCKET_STREAM_HANDLER(process_ws);
HTTP_STREAM_HANDLER(process_ota);
HTTP_HANDLER(process_accessories);
HTTP_HANDLER(process_loco);
HTTP_HANDLER(process_fs);

extern const uint8_t indexHtmlGz[] asm("_binary_index_html_gz_start");
extern const size_t indexHtmlGz_size asm("index_html_gz_length");

extern const uint8_t loco32x32[] asm("_binary_loco_32x32_png_start");
extern const size_t loco32x32_size asm("loco_32x32_png_length");

extern const uint8_t cashJsGz[] asm("_binary_cash_min_js_gz_start");
extern const size_t cashJsGz_size asm("cash_min_js_gz_length");

extern const uint8_t spectreCssGz[] asm("_binary_spectre_min_css_gz_start");
extern const size_t spectreCssGz_size asm("spectre_min_css_gz_length");

extern const uint8_t cdiJsGz[] asm("_binary_cdi_js_gz_start");
extern const size_t cdiJsGz_size asm("cdi_js_gz_length");

// TODO: add accessory method that wraps this usage
#define GET_LOCO_VIA_EXECUTOR(NAME, address)                                   \
  openlcb::TrainImpl *NAME = nullptr;                                          \
  Singleton<LocoManager>::instance()->train_service()->executor()->sync_run(   \
      ([&]()                                                                   \
       { NAME = Singleton<LocoManager>::instance()->find_or_create_train(      \
             DriveMode::DCC_128, address); }));

// TODO: add accessory method that wraps this usage
#define REMOVE_LOCO_VIA_EXECUTOR(addr)                                        \
  Singleton<LocoManager>::instance()->train_service()->executor()->sync_run(  \
      ([&]()                                                                  \
       { Singleton<LocoManager>::instance()->delete_train(DriveMode::DCC_ANY, addr); }));

uninitialized<CDIClient> cdi_client;
uninitialized<CDIDownloadHandler> cdi_downloader;
static NodeHandle cs_node_handle;
static NvsManager *nvs;
static Esp32TrainDatabase *cs_traindb;

#ifndef CONFIG_STATUS_LED_DATA_PIN
#define CONFIG_STATUS_LED_DATA_PIN -1
#endif

namespace openlcb
{
  extern const char CDI_DATA[];
  extern const size_t CDI_SIZE;
}

void init_webserver(Service *service, NvsManager *nvs_mgr, openlcb::Node *node,
                    openlcb::MemoryConfigHandler *mem_cfg,
                    Esp32TrainDatabase *train_db)
{
  nvs = nvs_mgr;
  cs_traindb = train_db;
  auto httpd = Singleton<Httpd>::instance();
  cs_node_handle = NodeHandle(nvs->node_id());
  cdi_client.emplace(service, node, mem_cfg);
  cdi_downloader.emplace(service, node, mem_cfg);
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5,0,0)
  httpd->captive_portal(
      StringPrintf(CAPTIVE_PORTAL_HTML, esp_app_get_description()->version));
#else
  httpd->captive_portal(
      StringPrintf(CAPTIVE_PORTAL_HTML, esp_ota_get_app_description()->version));
#endif // IDF v5.0+
  httpd->static_uri("/", indexHtmlGz, indexHtmlGz_size, MIME_TYPE_TEXT_HTML, HTTP_ENCODING_GZIP, false);
  httpd->static_uri("/loco-32x32.png", loco32x32, loco32x32_size, MIME_TYPE_IMAGE_PNG);
  httpd->static_uri("/cash.min.js", cashJsGz, cashJsGz_size, MIME_TYPE_TEXT_JAVASCRIPT, HTTP_ENCODING_GZIP);
  httpd->static_uri("/spectre.min.css", spectreCssGz, spectreCssGz_size, MIME_TYPE_TEXT_CSS, HTTP_ENCODING_GZIP);
  httpd->static_uri("/cdi.js", cdiJsGz, cdiJsGz_size, MIME_TYPE_TEXT_JAVASCRIPT, HTTP_ENCODING_GZIP);
  httpd->static_uri("/cdi.xml", (const uint8_t *)openlcb::CDI_DATA,
                    openlcb::CDI_SIZE, MIME_TYPE_TEXT_XML);
  httpd->websocket_uri("/ws", process_ws);
  httpd->uri("/update", HttpMethod::POST, nullptr, process_ota);
  httpd->uri("/fs", HttpMethod::GET, process_fs);
  httpd->uri("/accessories", process_accessories);
  httpd->uri("/locomotive", process_loco);
  httpd->uri("/locomotive/roster", process_loco);
  httpd->uri("/locomotive/estop", process_loco);
}

WEBSOCKET_STREAM_HANDLER_IMPL(process_ws, socket, event, data, len)
{
  if (event == WebSocketEvent::WS_EVENT_TEXT)
  {
    string response = R"!^!({"res":"error","error":"Request not understood"})!^!";
    string req = string((char *)data, len);
    LOG(VERBOSE, "[WS] MSG: %s", req.c_str());
    cJSON *root = cJSON_Parse(req.c_str());
    cJSON *req_type = cJSON_GetObjectItem(root, "req");
    cJSON *req_id = cJSON_GetObjectItem(root, "id");
    if (req_type == NULL || req_id == NULL)
    {
      // NO OP, the websocket is outbound only to trigger events on the client side.
      LOG(INFO, "[WS] Failed to parse:%s", req.c_str());
    }
    else if (!strcmp(req_type->valuestring, "info"))
    {
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5,0,0)
      const esp_app_desc_t *app_data = esp_app_get_description();
#else
      const esp_app_desc_t *app_data = esp_ota_get_app_description();
#endif // IDF v5.0+
      const esp_partition_t *partition = esp_ota_get_running_partition();
      response =
          StringPrintf(R"!^!({"res":"info","timestamp":"%s %s","ota":"%s","snip_name":"%s","snip_hw":"%s","snip_sw":"%s","node_id":"%s","statusLED":%s,"statusLEDBrightness":%d,"id":%d})!^!",
                       app_data->date, app_data->time, partition->label,
                       openlcb::SNIP_STATIC_DATA.model_name,
                       openlcb::SNIP_STATIC_DATA.hardware_version,
                       openlcb::SNIP_STATIC_DATA.software_version,
                       uint64_to_string_hex(nvs->node_id()).c_str(),
#if defined(CONFIG_STATUS_LED_DATA_PIN) && CONFIG_STATUS_LED_DATA_PIN != -1
                       "true",
#else
                       "false",
#endif
                       Singleton<StatusLED>::instance()->getBrightness(), req_id->valueint);
    }
    else if (!strcmp(req_type->valuestring, "cdi"))
    {
      if (cJSON_HasObjectItem(root, "cdi"))
      {
        BufferPtr<CDIDownloadRequest> b(cdi_downloader->alloc());
        b->data()->reset(cs_node_handle.id, "target", socket);
        b->data()->done.reset(EmptyNotifiable::DefaultInstance());
        cdi_downloader->send(b->ref());
        response =
            StringPrintf(R"!^!({"res":"cdi", "status":"processing","id":%d})!^!", req_id->valueint);
      }
      else if (!cJSON_HasObjectItem(root, "ofs") ||
               !cJSON_HasObjectItem(root, "type") ||
               !cJSON_HasObjectItem(root, "sz") ||
               !cJSON_HasObjectItem(root, "tgt") ||
               !cJSON_HasObjectItem(root, "spc"))
      {
        LOG_ERROR("[WS:%d] One or more required parameters are missing: %s", req_id->valueint, req.c_str());
        response =
            StringPrintf(R"!^!({"res":"error","error":"One (or more) required fields are missing.","id":%d})!^!", req_id->valueint);
      }
      else
      {
        size_t offs = cJSON_GetObjectItem(root, "ofs")->valueint;
        std::string param_type =
            cJSON_GetObjectItem(root, "type")->valuestring;
        size_t size = cJSON_GetObjectItem(root, "sz")->valueint;
        string target = cJSON_GetObjectItem(root, "tgt")->valuestring;
        uint8_t space = cJSON_GetObjectItem(root, "spc")->valueint;
        BufferPtr<CDIClientRequest> b(cdi_client->alloc());

