atanisoft/ESP32CommandStation/main/WebServer.cpp
        if (!cJSON_HasObjectItem(root, "val"))
        {
          LOG(INFO,
              "[WS:%d] Sending CDI READ: offs:%zu size:%zu type:%s tgt:%s spc:%d",
              req_id->valueint, offs, size, param_type.c_str(), target.c_str(),
              space);
          b->data()->reset(CDIClientRequest::READ, cs_node_handle,
                           socket, req_id->valueint, offs, size, target,
                           param_type, space);
        }
        else
        {
          string value = "";
          cJSON *raw_value = cJSON_GetObjectItem(root, "val");
          if (param_type == "str")
          {
            // copy of up to the reported size.
            value = string(raw_value->valuestring, size);
            // ensure value is null terminated
            value += '\0';
          }
          else if (param_type == "int")
          {
            if (size == 1)
            {
              uint8_t data8 = std::stoi(raw_value->valuestring);
              value.clear();
              value.push_back(data8);
            }
            else if (size == 2)
            {
              uint16_t data16 = std::stoi(raw_value->valuestring);
              value.clear();
              value.push_back((data16 >> 8) & 0xFF);
              value.push_back(data16 & 0xFF);
            }
            else
            {
              uint32_t data32 = std::stoul(raw_value->valuestring);
              value.clear();
              value.push_back((data32 >> 24) & 0xFF);
              value.push_back((data32 >> 16) & 0xFF);
              value.push_back((data32 >> 8) & 0xFF);
              value.push_back(data32 & 0xFF);
            }
          }
          else if (param_type == "evt")
          {
            uint64_t data = utils::string_to_uint64(string(raw_value->valuestring));
            value.clear();
            value.push_back((data >> 56) & 0xFF);
            value.push_back((data >> 48) & 0xFF);
            value.push_back((data >> 40) & 0xFF);
            value.push_back((data >> 32) & 0xFF);
            value.push_back((data >> 24) & 0xFF);
            value.push_back((data >> 16) & 0xFF);
            value.push_back((data >> 8) & 0xFF);
            value.push_back(data & 0xFF);
          }
          LOG(INFO,
              "[WS:%d] Sending CDI WRITE: offs:%zu value:%s tgt:%s spc:%d",
              req_id->valueint, offs, raw_value->valuestring, target.c_str(),
              space);
          b->data()->reset(CDIClientRequest::WRITE, cs_node_handle,
                           socket, req_id->valueint, offs, size, target,
                           value, space);
        }
        b->data()->done.reset(EmptyNotifiable::DefaultInstance());
        cdi_client->send(b->ref());
        cJSON_Delete(root);
        return;
      }
    }
    else if (!strcmp(req_type->valuestring, "update-complete"))
    {
      LOG(INFO, "[WS:%d] Sending UPDATE_COMPLETE to queue", req_id->valueint);
      BufferPtr<CDIClientRequest> b(cdi_client->alloc());
      b->data()->reset(CDIClientRequest::UPDATE_COMPLETE, cs_node_handle, socket,
                       req_id->valueint);
      b->data()->done.reset(EmptyNotifiable::DefaultInstance());
      cdi_client->send(b->ref());
      cJSON_Delete(root);
      return;
    }
    else if (!strcmp(req_type->valuestring, "reboot"))
    {
      LOG(INFO, "[WS:%d] Sending REBOOT to queue", req_id->valueint);
      BufferPtr<CDIClientRequest> b(cdi_client->alloc());
      b->data()->reset(CDIClientRequest::REBOOT, cs_node_handle, req_id->valueint);
      b->data()->done.reset(EmptyNotifiable::DefaultInstance());
      cdi_client->send(b->ref());
      cJSON_Delete(root);
      return;
    }
    else if (!strcmp(req_type->valuestring, "factory-reset"))
    {
      LOG(VERBOSE, "[WS:%d] Factory reset received", req_id->valueint);
      nvs->force_factory_reset();
      Singleton<esp32cs::DelayRebootHelper>::instance()->start();
      response =
          StringPrintf(R"!^!({"res":"factory-reset","id":%d})!^!", req_id->valueint);
    }
    else if (!strcmp(req_type->valuestring, "bootloader"))
    {
      LOG(VERBOSE, "[WS:%d] bootloader request received", req_id->valueint);
      enter_bootloader();
      // NOTE: This response may not get sent to the client.
      response =
          StringPrintf(R"!^!({"res":"bootloader","id":%d})!^!", req_id->valueint);
    }
    else if (!strcmp(req_type->valuestring, "reset-events"))
    {
      LOG(VERBOSE, "[WS:%d] Reset event IDs received", req_id->valueint);
      nvs->force_reset_events();
      response =
          StringPrintf(R"!^!({"res":"reset-events","id":%d})!^!", req_id->valueint);
    }
    else if (!strcmp(req_type->valuestring, "event"))
    {
      if (!cJSON_HasObjectItem(root, "evt"))
      {
        LOG_ERROR("[WS:%d] One or more required parameters are missing: %s",
                  req_id->valueint, req.c_str());
        response =
            StringPrintf(R"!^!({"res":"error","error":"The 'evt' field must be provided","id":%d})!^!",
                         req_id->valueint);
      }
      else
      {
        string value = cJSON_GetObjectItem(root, "evt")->valuestring;
        LOG(VERBOSE, "[WS:%d] Sending event: %s", req_id->valueint,
            value.c_str());
        uint64_t eventID = utils::string_to_uint64(value);
        Singleton<EventBroadcastHelper>::instance()->send_event(eventID);
        response =
            StringPrintf(R"!^!({"res":"event","evt":"%s","id":%d})!^!",
                         value.c_str(), req_id->valueint);
      }
    }
    else if (!strcmp(req_type->valuestring, "function"))
    {
      if (!cJSON_HasObjectItem(root, "addr") ||
          !cJSON_HasObjectItem(root, "fn") ||
          !cJSON_HasObjectItem(root, "state"))
      {
        LOG_ERROR("[WS:%d] One or more required parameters are missing: %s", req_id->valueint, req.c_str());
        response =
            StringPrintf(R"!^!({"res":"error","error":"One (or more) required fields are missing.","id":%d})!^!", req_id->valueint);
      }
      else
      {
        uint16_t address = cJSON_GetObjectItem(root, "addr")->valueint;
        uint8_t function = cJSON_GetObjectItem(root, "fn")->valueint;
        uint8_t state = cJSON_IsTrue(cJSON_GetObjectItem(root, "state"));
        LOG(VERBOSE, "[WS:%d] Setting function %d on loco %d to %d", req_id->valueint, address, function, state);
        GET_LOCO_VIA_EXECUTOR(train, address);
        train->set_fn(function, state);
        response =
            StringPrintf(R"!^!({"res":"function","id":%d,"fn":%d,"state":%s})!^!",
                         req_id->valueint, function, train->get_fn(function) == 1 ? "true" : "false");
      }
    }
    else if (!strcmp(req_type->valuestring, "loco"))
    {
      if (!cJSON_HasObjectItem(root, "addr"))
      {
        LOG_ERROR("[WS:%d] One or more required parameters are missing: %s", req_id->valueint, req.c_str());
        response =
            StringPrintf(R"!^!({"res":"error","error":"The 'addr' field must be provided","id":%d})!^!", req_id->valueint);
      }
      else if (!cJSON_HasObjectItem(root, "act"))
      {
        LOG_ERROR("[WS:%d] One or more required parameters are missing: %s", req_id->valueint, req.c_str());
        response =
            StringPrintf(R"!^!({"res":"error","error":"The 'act' field must be provided","id":%d})!^!", req_id->valueint);
      }
      else
      {
        uint16_t address = cJSON_GetObjectItem(root, "addr")->valueint;
        if (address > 0) {
          string action = cJSON_GetObjectItem(root, "act")->valuestring;
          if (action == "del")
          {
            LOG(VERBOSE, "[WS:%d] loco %d Delete", req_id->valueint, address);
            REMOVE_LOCO_VIA_EXECUTOR(address);
            response =
              StringPrintf(R"!^!({"res":"loco","addr":%d,"act":"%s","id":%d})!^!",
                           address, action.c_str(), req_id->valueint);
          }
          else if (action == "sel")
          {
            LOG(VERBOSE, "[WS:%d] loco %d Select", req_id->valueint, address);
            GET_LOCO_VIA_EXECUTOR(train, address);
            response =
              StringPrintf(R"!^!({"res":"loco","addr":%d,"spd":0,"dir":false,"act":"%s","id":%d)!^!",
                          address, action.c_str(), req_id->valueint);
            auto db_entry = cs_traindb->get_entry(address);
            if (db_entry)
            {
              LOG(VERBOSE, "[WS:%d] db entry found, serializing functions",
                  req_id->valueint);
              // NOTE: function zero is always mapped to headlight
              response += StringPrintf(
                R"!^!(,"fn":[{"id":0,"name":"%s"})!^!",
                locodb::function_to_string(locodb::Function::HEADLIGHT));
              uint8_t fn_count = 1;
              db_entry->start_read_functions();
              size_t max_function_id = db_entry->get_max_fn();
              if (max_function_id > locodb::MAX_LOCO_FUNCTIONS)
              {
                max_function_id = locodb::MAX_LOCO_FUNCTIONS;
              }
              // scan available functions and send function details
              for (size_t fn = 1;
                   fn < max_function_id && db_entry->is_function_valid(fn);
                   fn++)
              {
                auto fn_def = db_entry->get_function_def(fn);
                // skip entries that are metadata only (or otherwise invalid)
                if (fn_def != locodb::Function::NONEXISTANT &&
                    fn_def != locodb::Function::UNINITIALIZED &&
                    fn_def != locodb::Function::MOMENTARY &&
                    fn_def != locodb::Function::UNKNOWN)
                {
                  LOG(VERBOSE, "[WS:%d] fn: %zu, type: %d",
                      req_id->valueint, fn, fn_def);
                  if (fn_count > 0)
                  {
                    response += ",";
                  }
                  const char* label = locodb::function_to_string(fn_def);
                  if (label)
                  {
                    response += StringPrintf(R"!^!({"id":%zu,"name":"%s"})!^!", fn, label);
                  }
                  else
                  {
                    response += StringPrintf(R"!^!({"id":%zu,"name":"f%d"})!^!", fn, fn);
                  }
                  fn_count++;
                }
              }
              response += "]";
            }
            response += "}";
          }
          else if (action == "upd")
          {
            LOG(INFO, "[WS:%d] loco %d Update", req_id->valueint, address);
            GET_LOCO_VIA_EXECUTOR(train, address);
            auto req_speed = train->get_speed();
            SpeedType direction = req_speed.direction();
            if (cJSON_HasObjectItem(root, "spd"))
            {
              uint8_t speed = cJSON_GetObjectItem(root, "spd")->valueint;
              LOG(VERBOSE, "[WS:%d] Setting loco %d speed to %d",
                  req_id->valueint, address, speed);
              req_speed.set_mph(speed);
            }
            if (cJSON_HasObjectItem(root, "dir"))
            {
              bool direction = cJSON_IsTrue(cJSON_GetObjectItem(root, "dir"));
              LOG(VERBOSE, "[WS:%d] Setting loco %d direction to %s",
                  req_id->valueint, address, direction ? "REV" : "FWD");
              req_speed.set_direction(direction);
            }
            train->set_speed(req_speed);
            response =
              StringPrintf(R"!^!({"res":"loco","addr":%d,"spd":%d,"dir":%s,"act":"%s","id":%d})!^!",
                          address, (int)req_speed.mph(),
                          req_speed.direction() ? "true" : "false", action.c_str(),
                          req_id->valueint);
          }
          else
          {
            response =
              StringPrintf(R"!^!({"res":"error","error":"Action (%s) is not understood for address %d","id":%d})!^!",
                           action.c_str(), address, req_id->valueint);
          }
        } else {
          response =
            StringPrintf(R"!^!({"res":"error","error":"The requested address (%d) is not valid","id":%d})!^!",
                         address, req_id->valueint);
        }
      }
    }
    else if (!strcmp(req_type->valuestring, "accessory"))
    {
      if (!cJSON_HasObjectItem(root, "addr") ||
          !cJSON_HasObjectItem(root, "act"))
      {
        LOG_ERROR("[WS:%d] One or more required parameters are missing: %s",
                  req_id->valueint, req.c_str());
        response =
            StringPrintf(R"!^!({"res":"error","error":"One (or more) required fields are missing.","id":%d})!^!",
                         req_id->valueint);
      }
      else
      {
        auto db = Singleton<AccessoryDecoderDB>::instance();
        uint16_t address = cJSON_GetObjectItem(root, "addr")->valueint;
        string name = std::to_string(address);
        string action = cJSON_GetObjectItem(root, "act")->valuestring;
        string target = cJSON_HasObjectItem(root, "tgt") ? cJSON_GetObjectItem(root, "tgt")->valuestring : "";
        bool state = false;
        AccessoryType type = AccessoryType::UNCHANGED;
        if (cJSON_HasObjectItem(root, "type"))
        {
          type = (AccessoryType)cJSON_GetObjectItem(root, "type")->valueint;
        }
        if (cJSON_HasObjectItem(root, "name"))
        {
          name = cJSON_GetObjectItem(root, "name")->valuestring;
        }
        if (action == "save")
        {
          LOG(VERBOSE, "[WS:%d] Saving accessory %d as type %d",
              req_id->valueint, address, type);
          if (cJSON_IsTrue(cJSON_GetObjectItem(root, "olcb")))
          {
            db->createOrUpdateOlcb(address, name,
                                   cJSON_GetObjectItem(root, "closed")->valuestring,
                                   cJSON_GetObjectItem(root, "thrown")->valuestring, type);
          }
          else
          {
            db->createOrUpdateDcc(address, name, type);
          }
        }
        else if (action == "toggle")
        {
          LOG(VERBOSE, "[WS:%d] Toggling accessory %d", req_id->valueint,
              address);
          state = db->toggle(address);
        }
        else if (action == "delete")
        {
          LOG(VERBOSE, "[WS:%d] Deleting accessory %d", req_id->valueint,
              address);
          db->remove(address);
        }
        response =
            StringPrintf(R"!^!({"res":"accessory","act":"%s","addr":%d,"name":"%s","tgt":"%s","state":%d,"type":%d,"id":%d})!^!",
                         action.c_str(), address, name.c_str(), target.c_str(),
                         state, type, req_id->valueint);
      }
    }
    else if (!strcmp(req_type->valuestring, "roster"))
    {
      if (!cJSON_HasObjectItem(root, "addr") ||
          !cJSON_HasObjectItem(root, "act"))
      {
        LOG_ERROR("[WS:%d] One or more required parameters are missing: %s",
                  req_id->valueint, req.c_str());
        response =
            StringPrintf(R"!^!({"res":"error","error":"One (or more) required fields are missing.","id":%d})!^!",
                         req_id->valueint);
      }
      else
      {
        uint16_t address = cJSON_GetObjectItem(root, "addr")->valueint;
        string action = cJSON_GetObjectItem(root, "act")->valuestring;
        string target = cJSON_HasObjectItem(root, "tgt") ? cJSON_GetObjectItem(root, "tgt")->valuestring : "";
        if (action == "save")
        {
          LOG(VERBOSE, "[WS:%d] Creating/Updating roster entry %d",
              req_id->valueint, address);
          string name = cJSON_GetObjectItem(root, "name")->valuestring;
          string description = cJSON_GetObjectItem(root, "desc")->valuestring;
          DriveMode mode =
              static_cast<DriveMode>(cJSON_GetObjectItem(root, "mode")->valueint);
          bool idle = cJSON_IsTrue(cJSON_GetObjectItem(root, "idle"));
          cs_traindb->create_or_update(address, name, description, mode, idle);
        }
        else if (action == "delete")
        {
          LOG(VERBOSE, "[WS:%d] Deleting roster entry %d",
              req_id->valueint, address);
          cs_traindb->remove_entry(address, DriveMode::DCC_ANY);
        }
        response =
            StringPrintf(R"!^!({"res":"roster","act":"%s","tgt":"%s","id":%d})!^!",
                         action.c_str(), target.c_str(), req_id->valueint);
      }
    }
    else if (!strcmp(req_type->valuestring, "ping"))
    {
      LOG(VERBOSE, "[WS:%d] PING received", req_id->valueint);
      response =
          StringPrintf(R"!^!({"res":"pong","id":%d})!^!", req_id->valueint);
    }
    else if (!strcmp(req_type->valuestring, "status"))
    {
      LOG(VERBOSE, "[WS:%d] STATUS received", req_id->valueint);
      auto track = get_dcc_output(DccOutput::Type::TRACK);
      uint8_t track_status = track->get_disable_output_reasons();
      if (track_status & (uint8_t)DccOutput::DisableReason::SHORTED ||
          track_status & (uint8_t)DccOutput::DisableReason::THERMAL)
      {
        response =
            StringPrintf(R"!^!({"res":"status","id":%d,"track":"Fault"})!^!",
                         req_id->valueint);
      }
      else if (track_status != 0)
      {
        response =
            StringPrintf(R"!^!({"res":"status","id":%d,"track":"Off"})!^!",
                         req_id->valueint);
      }
      else
      {
        response =
            StringPrintf(R"!^!({"res":"status","id":%d,"track":"On","usage":%)!^!" PRIu32 R"!^!(})!^!",
                         req_id->valueint, esp32cs::get_ops_load());
      }
    }
    else if (!strcmp(req_type->valuestring, "statusled"))
    {
      cJSON *value = cJSON_GetObjectItem(root, "val");
      LOG(VERBOSE, "[WS:%d] statusled received, new brightness:%d", req_id->valueint, value->valueint);
      Singleton<StatusLED>::instance()->setBrightness(value->valueint);
      response =
          StringPrintf(R"!^!({"res":"statusled","id":%d})!^!", req_id->valueint);
    }
    else
    {
      LOG_ERROR("Unrecognized request: %s", req.c_str());
    }
    cJSON_Delete(root);
    LOG(VERBOSE, "[Web] WS: %s -> %s", req.c_str(), response.c_str());
    socket->send_text(response);
  }
}

#define OTA_RETURN_ON_FAILURE(result, message, error_text)          \
  if (result != ESP_OK)                                             \
  {                                                                 \
    Singleton<OTAWatcherFlow>::instance()->report_failure(result);  \
    *abort_req = true;                                              \
    return new JsonResponse(error_text);                            \
  }

esp_ota_handle_t otaHandle;
esp_partition_t *ota_partition = nullptr;
HTTP_STREAM_HANDLER_IMPL(process_ota, request, filename, size, data, length, offset, final, abort_req)
{
  if (!offset)
  {
    esp_log_level_set("esp_image", ESP_LOG_VERBOSE);
    ota_partition = (esp_partition_t *)esp_ota_get_next_update_partition(NULL);
    OTA_RETURN_ON_FAILURE(
      ESP_ERROR_CHECK_WITHOUT_ABORT(esp_ota_begin(ota_partition, size, &otaHandle)),
      "[WebSrv] OTA start failed, aborting!",
      R"!^!({"status":"error","text":"Failed to locate a usable flash partition, restart the command station and try again."})!^!")
    LOG(INFO, "[WebSrv] OTA Update starting (%zu bytes, target:%s)...", size, ota_partition->label);
    Singleton<OTAWatcherFlow>::instance()->report_start();
  }

