atanisoft/ESP32CommandStation/main/WebServer.cpp
  HASSERT(ota_partition);
  LOG(INFO, "[WebSrv] OTA Recevied %zu bytes...", length);
  OTA_RETURN_ON_FAILURE(
    ESP_ERROR_CHECK_WITHOUT_ABORT(esp_ota_write(otaHandle, data, length)),
    "[WebSrv] OTA write failed, aborting!",
      R"!^!({"status":"error","text":"Failed to write to flash, restart the command station and try again."})!^!")
  Singleton<OTAWatcherFlow>::instance()->report_progress(length);

  if (final)
  {
    LOG(INFO, "[WebSrv] OTA Received final segment, attempting to validate");
    OTA_RETURN_ON_FAILURE(
      ESP_ERROR_CHECK_WITHOUT_ABORT(esp_ota_end(otaHandle)),
      "[WebSrv] OTA end failed, aborting!",
      R"!^!({"status":"error","text":"Software update failed validations, restart the command station and try again."})!^!")
    LOG(INFO, "[WebSrv] OTA binary validated, setting boot partition: %s", ota_partition->label);

    OTA_RETURN_ON_FAILURE(
      ESP_ERROR_CHECK_WITHOUT_ABORT(esp_ota_set_boot_partition(ota_partition)),
      "[WebSrv] OTA partition update failed, aborting!",
      R"!^!({"status":"error","text":"Software update failed to apply the update, restart the command station and try again."})!^!")
    LOG(INFO, "[WebSrv] OTA Update Complete!");
    Singleton<OTAWatcherFlow>::instance()->report_success();
    request->set_status(HttpStatusCode::STATUS_OK);
    return new JsonResponse(R"!^!({"status":"ok","text":"Software updated, command station will reboot.})!^!");
  }

  return nullptr;
}

/// Filesystem access handler.
///
/// Accepted methods: GET
/// URIs:
///`
///   /fs?path={path}                   - returns the referenced file as-is.
///   /fs?path={path}&remove_nulls=true - returns the referenced file with null characters replaced with space.
///`
/// NOTE: At this time only text like files can be downloaded.
HTTP_HANDLER_IMPL(process_fs, request)
{
  if (request->method() != HttpMethod::GET)
  {
    request->set_status(HttpStatusCode::STATUS_BAD_REQUEST);
    return nullptr;
  }
  string path = request->param("path");
  struct stat statbuf;
  // verify that the requested path exists
  if (!stat(path.c_str(), &statbuf))
  {
    string mimetype = http::MIME_TYPE_TEXT_PLAIN;
    if (path.find(".xml") != string::npos)
    {
      mimetype = MIME_TYPE_TEXT_XML;
    }
    else if (path.find(".json") != string::npos)
    {
      mimetype = http::MIME_TYPE_APPLICATION_JSON;
    }
    else
    {
      // unknown file type, reject the request
      request->set_status(HttpStatusCode::STATUS_NOT_ALLOWED);
      return nullptr;
    }
    string data = read_file_to_string(path);
    // CDI xml files have a trailing null, this can cause issues in the
    // browser that is parsing/rendering the XML data.
    if (request->param("remove_nulls", false))
    {
      std::replace(data.begin(), data.end(), '\0', ' ');
    }
    return new StringResponse(data, mimetype);
  }
  request->set_status(HttpStatusCode::STATUS_NOT_FOUND);
  return nullptr;
}

// GET /accessories - full list of accessory decoders, note that accessory state is STRING type for display
// GET /accessories?readbleStrings=[0,1] - full list of accessory decoders, accessory state will be returned as true/false (boolean) when readableStrings=0.
// GET /accessories?address=<address> - retrieve accessory decoders by DCC address
// PUT /accessories?address=<address> - toggle accessory decoders by DCC address
// POST /accessories?address=<address>&name=<name>&type=<type> - creates a new accessory decoder
// DELETE /accessories?address=<address> - delete accessory decoders by DCC address
//
// For successful requests the result code will be 200 and either an array of accessory decoders or single accessory decoders will be returned.
// For unsuccessful requests the result code will be 400 (bad request, missing args), 404 (not found), 500 (server failure).
//
HTTP_HANDLER_IMPL(process_accessories, request)
{
  bool readable = request->param("readbleStrings", false);
  auto db = Singleton<AccessoryDecoderDB>::instance();
  if (request->method() == HttpMethod::GET &&
      !request->has_param("address"))
  {
    return new JsonResponse(db->to_json(readable));
  }

  uint16_t address = request->param("address", 0);
  if (address < 1 || address > 2044)
  {
    request->set_status(HttpStatusCode::STATUS_BAD_REQUEST);
  }
  else if (request->method() == HttpMethod::GET)
  {
    auto accessory = db->to_json(address, readable);
    return new JsonResponse(accessory);
  }
  else if (request->method() == HttpMethod::POST)
  {
    AccessoryType type =
        (AccessoryType)request->param("type", AccessoryType::UNKNOWN);
    string name = request->param("name");
    if (name.empty())
    {
      name = std::to_string(address);
    }
    db->createOrUpdateDcc(address, name, type);
    auto accessory = db->to_json(address, readable);
    return new JsonResponse(accessory);
  }
  else if (request->method() == HttpMethod::DELETE)
  {
    if (db->remove(address))
    {
      request->set_status(HttpStatusCode::STATUS_NO_CONTENT);
    }
    else
    {
      request->set_status(HttpStatusCode::STATUS_NOT_FOUND);
    }
  }
  else if (request->method() == HttpMethod::PUT)
  {
    db->toggle(address);
    request->set_status(HttpStatusCode::STATUS_NO_CONTENT);
  }
  return nullptr;
}

string convert_loco_to_json(openlcb::TrainImpl *t)
{
  if (!t)
  {
    return "{}";
  }
  string res =
      StringPrintf(R"!^!({"addr":%)!^!" PRIu32 R"!^!(,"spd":%d,"dir":"%s","fn":[)!^!",
                   t->legacy_address(), (int)t->get_speed().mph(),
                   t->get_speed().direction() == dcc::SpeedType::REVERSE ? "REV" : "FWD");
  for (size_t funcID = 0; funcID < locodb::MAX_LOCO_FUNCTIONS; funcID++)
  {
    if (funcID)
    {
      res += ",";
    }
    res += StringPrintf(R"!^!({"id":%d,"state":%d})!^!", funcID,
                        t->get_fn(funcID));
  }
  res += "]}";
  return res;
}

// method - url pattern - meaning
// ANY /locomotive/estop - send emergency stop to all locomotives
// GET /locomotive/roster - roster
// GET /locomotive/roster?address=<address> - get roster entry
// PUT / POST /locomotive/roster?address=<address>&name=<name>&desc=<desc>&mode=<mode>&idle=[true|false] - create or update roster entry
// DELETE /locomotive/roster?address=<address> - delete roster entry
// GET /locomotive - get active locomotives
// POST /locomotive?address=<address> - add locomotive to active management
// GET /locomotive?address=<address> - get locomotive state
// PUT /locomotive?address=<address>&speed=<speed>&dir=[FWD|REV]&fX=[true|false] - Update locomotive state, fX is short for function X where X is 0-28.
// DELETE /locomotive?address=<address> - removes locomotive from active management
HTTP_HANDLER_IMPL(process_loco, request)
{
  string url = request->uri();
  request->set_status(HttpStatusCode::STATUS_BAD_REQUEST);

  // check if we have an eStop command, we don't care how this gets sent to the
  // command station (method) so check it first
  if (url.find("/estop") != string::npos)
  {
    Singleton<EventBroadcastHelper>::instance()->send_event(openlcb::Defs::EMERGENCY_STOP_EVENT);
    request->set_status(HttpStatusCode::STATUS_OK);
  }
  else if (url.find("/roster") != string::npos)
  {
    if (request->method() == HttpMethod::GET &&
        !request->has_param("address"))
    {
      return new JsonResponse(cs_traindb->to_json());
    }
    else if (request->has_param("address"))
    {
      uint16_t address = request->param("address", 0);
      if (address == 0 || address > dcc::DccLongAddress::ADDRESS_MAX)
      {
        LOG_ERROR("[WebSrv] Invalid address provided: %d", address);
        request->set_status(HttpStatusCode::STATUS_BAD_REQUEST);
      }
      else if (request->method() == HttpMethod::DELETE)
      {
        cs_traindb->remove_entry(address, DriveMode::DCC_ANY);
        request->set_status(HttpStatusCode::STATUS_NO_CONTENT);
      }
      else if (request->method() == HttpMethod::GET)
      {
        return new JsonResponse(cs_traindb->to_json(address));
      }
      else
      {
        string name = request->param("name");
        string description = request->param("desc");
        DriveMode mode = static_cast<DriveMode>(
            request->param("mode", DriveMode::DCC_128));
        bool idle = request->param("idle", false);
        cs_traindb->create_or_update(address, name, description, mode, idle);
        // search for and remap functions if present
        for (uint8_t fn = 1; fn < locodb::MAX_LOCO_FUNCTIONS; fn++)
        {
          string fArg = StringPrintf("f%d", fn);
          if (request->has_param(fArg.c_str()))
          {
            Function label =
                static_cast<Function>(
                    request->param(fArg, Function::UNKNOWN));
            cs_traindb->set_train_function_label(address, fn, label);
          }
        }
        return new JsonResponse(cs_traindb->to_json(address));
      }
    }
  }
  else
  {
    // Since it is not an eStop or roster command we need to check the request
    // method and ensure it contains the required arguments otherwise the
    // request should be rejected
    if (request->method() == HttpMethod::GET &&
        !request->has_param("address"))
    {
      // get all active locomotives
      string res = "[";
      auto trains = Singleton<LocoManager>::instance();
      for (size_t id = 0; id < trains->size(); id++)
      {
        auto nodeid = trains->get_train_node_id(id);
        if (nodeid)
        {
          auto loco = trains->find_train(nodeid);
          if (loco)
          {
            if (res.length() > 1)
            {
              res += ",";
            }
            res += convert_loco_to_json(loco);
          }
        }
      }
      res += "]";
      return new JsonResponse(res);
    }
    else if (request->has_param("address"))
    {
      uint16_t address = request->param("address", 0);
      if (address == 0 || address > dcc::DccLongAddress::ADDRESS_MAX)
      {
        LOG_ERROR("[WebSrv] Invalid address provided: %d", address);
        request->set_status(HttpStatusCode::STATUS_BAD_REQUEST);
      }
      else if (request->method() == HttpMethod::PUT ||
               request->method() == HttpMethod::POST)
      {
        GET_LOCO_VIA_EXECUTOR(loco, address);
        // Creation / Update of active locomotive
        if (request->has_param("idle"))
        {
          loco->set_speed(dcc::SpeedType(0));
        }
        if (request->has_param("speed"))
        {
          bool forward = true;
          if (request->has_param("dir"))
          {
            forward = !request->param("dir").compare("FWD");
          }
          auto speed = dcc::SpeedType::from_mph(request->param("speed", 0));
          if (!forward)
          {
            speed.set_direction(dcc::SpeedType::REVERSE);
          }
          loco->set_speed(speed);
        }
        else if (request->has_param("dir"))
        {
          bool forward = !request->param("dir").compare("FWD");
          auto upd_speed = loco->get_speed();
          upd_speed.set_direction(forward ? dcc::SpeedType::FORWARD
                                          : dcc::SpeedType::REVERSE);
          loco->set_speed(upd_speed);
        }

        for (uint8_t funcID = 0; funcID <= 28; funcID++)
        {
          string fArg = StringPrintf("f%d", funcID);
          if (request->has_param(fArg.c_str()))
          {
            loco->set_fn(funcID, request->param(fArg, false));
          }
        }
        return new JsonResponse(convert_loco_to_json(loco));
      }
      else if (request->method() == HttpMethod::DELETE)
      {
        REMOVE_LOCO_VIA_EXECUTOR(address)
        request->set_status(HttpStatusCode::STATUS_NO_CONTENT);
      }
      else
      {
        GET_LOCO_VIA_EXECUTOR(loco, address);
        return new JsonResponse(convert_loco_to_json(loco));
      }
    }
  }
  return nullptr;
}
